{
  "doctype": "html",
  "pretty": true,
  "basedir": "src",
  "data": {
    "projects": {
      "my": [
        {
          "title": "Toread.today",
          "slug": "toread-today",
          "externalURL": "https://toread-today.web.app",
          "description": "A cloud tool to organise things to read/watch later. Priorities, tags, statuses and other fancy stuff. Web, Desktop & Mobile app, Google Chrome extension.",
          "logoImageURL": "/img/projects/toread-today/logo.svg",
          "logoImageStyle": "padding: 3rem 0;",
          "logoText": "Toread.Today",
          "logoTextStyle": "color: white; font-size: 2rem;",
          "tags": ["Angular", "Node.js", "Express.js", "GCP", "Firebase", "Firestore"],
          "screenshotURLs": ["1.webp", "2.webp", "3.webp"]
        },
        {
          "title": "The Seed [private beta]",
          "description": "A one-person SaaS application codebase template. Ship your project idea in days instead of months. ⚠️ It is addictive.",
          "logoImageURL": "/img/projects/seed/logo.webp"
        },
        {
          "title": "YouTube Tech Channel",
          "externalURL": "https://www.youtube.com/channel/UCzHggR9W9OdquYOvBuEORiQ/videos",
          "description": "Short tech videos about software development and SaaS.",
          "logoImageURL": "/img/projects/youtube-channel/logo.svg"
        }
      ],
      "freelance": [
        {
          "title": "Corecircle",
          "slug": "corecircle",
          "role": "Tech Lead",
          "tags": ["Node.js", "Nest.js", "Nx monorepo", "GCP", "Firebase", "PostgreSQL", "Redis"],
          "logoImageURL": "/img/projects/corecircle/logo.svg",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp", "4.webp"],
          "description": "Fitness-focused social network with exercise tracking features and ML for recommendation system.",
          "externalURL": "https://corecircle.com"
        },
        {
          "title": "Connectful",
          "slug": "connectful",
          "role": "Tech Lead",
          "tags": ["Node.js", "Nest.js", "Nx monorepo", "GCP", "Firebase", "Firestore"],
          "logoImageURL": "/img/projects/connectful/logo.svg",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp"],
          "description": "Networking app with Tinder-like UI and Machine Learning algorithm to match like-minded people.",
          "externalURL": "https://connectful.com"
        },
        {
          "title": "FoodRazor",
          "slug": "foodrazor",
          "externalURL": "https://foodrazor.com",
          "description": "Digitize paper invoices, automating orders to suppliers, and tracking price fluctuations.",
          "role": "Tech Lead",
          "tags": ["Angular", "Node.js", "Express.js", "GCP", "Firebase", "Firestore"],
          "logoImageURL": "/img/projects/foodrazor/logo.svg",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp", "4.webp", "5.webp", "6.webp"],
          "videoURL": "https://youtube.com/embed/IL3M0A7g0SE"
        },
        {
          "title": "GoPingu",
          "slug": "gopingu",
          "role": "Full-stack",
          "tags": ["Angular", "Node.js", "Express.js", "Firebase", "Firestore"],
          "logoImageURL": "/img/projects/gopingu/logo.svg",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp", "4.webp", "5.webp"],
          "description": "Manage marketing teams via a Trello-like app that utilized a marketplace for project templates.",
          "externalURL": "https://app.gopingu.com"
        },
        {
          "title": "Microwork",
          "slug": "microwork",
          "externalURL": "https://microwork.io",
          "description": "Human text classification service freelance platform. Earn money by classifying things.",
          "role": "Full-stack",
          "tags": ["Angular", "Node.js", "Express.js", "Firebase", "Firestore"],
          "logoText": "ｍｉｃｒｏｗｏｒｋ.ｉｏ",
          "logoTextStyle": "color: white; font-weight: bold; font-size: 1.3rem;",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp", "4.webp", "5.webp"]
        },
        {
          "title": "Code review",
          "slug": "code-review",
          "externalURL": "https://spy4x.github.io/pb-code-review",
          "description": "Code review report for a Node.js REST API codebase. Callback hell, code inconsistency and fun.",
          "role": "Audit",
          "tags": ["Node.js", "Express.js"],
          "logoImageURL": "/img/projects/code-review/logo.svg",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp"]
        },
        {
          "title": "Sajari",
          "slug": "sajari",
          "role": "Frontend",
          "externalURL": "https://sajari.com",
          "description": "Dashboard single-page application for search and recommendations engine as a service.",
          "tags": ["Angular"],
          "logoImageURL": "/img/projects/sajari/logo.svg",
          "logoImageStyle": "padding: 3rem;",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp"]
        },
        {
          "title": "CallTrack",
          "slug": "calltrack",
          "externalURL": "https://ctrk.net",
          "description": "Analyze calls data from your call center and manage phone numbers based on various rules.",
          "role": "Frontend",
          "tags": ["Angular"],
          "logoText": "𝚌𝚝𝚛𝚔.𝚗𝚎𝚝",
          "logoTextStyle": "color: white; font-size: 2.5rem;",
          "screenshotURLs": ["1.webp", "2.webp", "3.webp", "4.webp", "5.webp", "6.webp", "7.webp"]
        }
      ]
    },
    "blogArticles": [
      {
        "id": 1,
        "title": "Why you have to ship your idea today and with shittiest code possible",
        "slug": "ship-it-today",
        "description": "And why so many developers abandon their attempts to release a product",
        "readTime": 5,
        "publishedAt": "2022.04.27",
        "previewImageURL": "/img/blog/ship-it-today/preview.webp",
        "mdContent": "<div class=\"well well--warning\">\n  <p>\n  Disclaimer: My blog is focused on developers who want to start doing their own projects. For shy tech geeks like myself. And it's SaaS-focused mostly. I guess you got the idea.\n  </p>\n</div>\n\n## Who is this article for?\nSoftware and application developers that have built dozens of applications for their clients, but not sure how to apply the experience collected along the way.   \nPerhaps you have started dreaming about launching your own startup. Your big thing, your rules, no more confusing tasks from your clients.  \nMaybe you even have your notes highlighting the  ideas of what you can build. You are basically all set for your personal sailing.  \nBut what's next?  \n\n## What is this article about?\nIn this article, I'll share my approach to shipping an app idea. This post is a compilation of mistakes I have made while working on my own projects and for my freelance clients.  \nHere, I motivate you to start where you are with what you have.  \nFuture articles will cover marketing, fundraising, technical infrastructure, and other topics important for the next steps.  \n\n## What to build?\nIt may sound weird, but you may not need a planet-size idea or a game-changer app. Your creation doesn't even have <a href=\"https://youtu.be/B8C5sjjhsso\" target=\"_blank\">to make the world a better place</a>. That would be awesome though.  \n> Sometimes all you need is just to help a group of people to get rid of their **small itch**.  \n\nIt can be something as small and simple as making a good <a href=\"https://inkdrop.app/\" target=\"_blank\">markdown editor</a>, a user <a href=\"https://www.upvoty.com/\" target=\"_blank\">feedback platform</a>, or a <a href=\"https://www.saaspegasus.com/\" target=\"_blank\">SaaS boilerplate</a>.\nMany apps of our days are overloaded with too many features and overwhelming UI. Sometimes all you need to outcompete your competitors is a high-quality product and a minimalistic approach.  \nKeeping things small will let you build a meaningful solution faster, reach your core audience easier and focus on what matters for MVP.  \n![You can't screw up too much if you do something small](/img/blog/ship-it-today/keep-it-small.webp)\n\nNote that when you start thinking about what \"idea\" to implement, you draw castles in the air - \"Good to have\" things, but unreal or useless. In contrast, when you think about \"what pain can I solve\" - your focus is on a real issue, which hurts someone every day.  \n\nIdeally, you choose something that is your personal itch. Something that you understand, something that you can judge if it solves the issue or not. When you work with your own pain - you don't need a group of testers. You are your best tester. You are part of your core audience. You can see the problem from the inside, instead of guessing about other people's pain.  \n\nBut make sure that others have this itch too. Some market research should be considered. Maybe talk to potential customers, use survey questionnaires, etc to see if you share the same pains.  \n\nOk, so you've chosen what to build (great if you did some research about competitors first) and you are ready for the next step, implementing your solution.  \n\n## How to build it?\nYou need to think about the features of your solution and what building blocks they will require. From design to frontend, to backend, to architecture. Diving into each will easily go beyond this article's borders, so let's define the core principles.\n\n1. Keep it as simple as possible in the beginning. That will let you move fast and change directions quickly during experimentation.\n2. Stick with your stack. The technology stack doesn't matter much now. You'll alter it multiple times in the future. Just start with whatever stack you are familiar with the most.\n3. It doesn’t have to be perfect. You'll most probably change the form of your solution multiple times before it stabilizes in the form that works.  You can polish it when you have a ready solution available.\n\nLet's look at each principle deeper.\n\n### Keep it simple stupid\nYou don't need complications at this stage. Things like linting, unit-/e2e- tests, and CI/CD automation are best practices. However, it’s best to keep them for a later stage. Do not let yourself drown in setting up everything for production. Remember that right now you just need to start. Once you have started and published something, you can go step by step to improve your dev workflow. Where it makes sense. When it makes sense. \n\n### Stick with your stack\nTo start you don't need to learn <a href=\"http://vanilla-js.com/\" target=\"_blank\">\"yet another fancy JS framework\"</a> (although it can be tempting and be an incentive to start). Just take your favorite stack, the thing you are the most experienced with. Sometimes you may get stuck thinking that your old bro [put your stack name here] is not good enough. Leave such thoughts away. You'll change it later. Maybe. Or maybe never. In any case, your end users do not care which tech you use if your solution solves their issue.\n\n![Use what you are experienced with](/img/blog/ship-it-today/use-what-you-are-experienced-with.webp)  \nIn one of my future articles, I'll share a technical stack that I use for my projects.\n\n### Let it be not perfect\nPerfectionism can block you from ever shipping.  \nMany of my clients spent years developing a fully functioning app with dozens of features without marketing and user feedback. Unfortunately for some of them, this whole path was only to realize that the product is not demanded by the market. Hundreds of thousands of dollars were spent for nothing (well, maybe for experience?).\n\nOnly switch to high-quality code, advanced dev workflow, and multiple features when you get people's interest and some paying customers. But not earlier than it's needed. You can have a big idea in your head. However, for the initial release - try to cut off everything that you won't need in the first month. Some SaaS companies leave subscription/payment module implementation for post-release. They know that they'll have at least 30 days to implement it. And it's totally fine. Publish it lean, make it grow muscles, and become polished over time.\n\n![Not perfect](/img/blog/ship-it-today/not-perfect.webp)\n\n## When to build?\nI have a rule - \"Publish something today and improve it every day\". When this article is live, my website is half done and lacks a lot of features. But  \n> It's better to have a solid half than a shitty whole.  \n\nDon't worry much, no one remembers when Google was published. Make yourself a 24h hackathon, develop a single-feature MVP, and just\n![Keep calm and ship it](/img/blog/ship-it-today/keep-calm-and-ship-it.webp)  \n<p style=\"text-align: center;\"><strong>Thank you for reading!</strong></p>\n\n<div class=\"well\">\n  <p>\n  This is my first blog post, and I'm very excited about it! 😊 Please share your feedback - it will help me improve my writing skills. Thanks!\n  </p>\n</div>"
      }
    ]
  }
}
